import Image from "next/image";
import React from "react";
import BoxAboute from "../../../components/pages/home/about/BoxAboute";
const sections = [
  {
    title: "اطلاعات تیم‌ها و بازیکنان",
    context: [
      "صفحات اختصاصی تیم‌ها و بازیکنان",
      "آمار، اخبار، عکس، ویدئو و نمودار عملکرد لحظه‌ای",
    ],
  },
  {
    title: "نتایج زنده",
    context: [
      "پوشش زنده مسابقات ورزشی",
      "نمایش نتایج، رخدادهای مهم، گلزنان و جزئیات بازی‌ها",
    ],
  },
  {
    title: "پوشش ۲۴ ساعته اخبار ورزشی",
    context: [
      "جدیدترین اخبار فوتبال، فوتسال، والیبال، بسکتبال، کشتی و …",
      "اطلاع‌رسانی لحظه‌ای رخدادهای ورزشی",
    ],
  },
  {
    title: "خلاصه بازی‌ها",
    context: [
      "ارائه ویدئوهای خلاصه بازی‌ها",
      "نمایش صحنه‌های حساس مسابقات به صورت لحظه‌ای",
    ],
  },
  {
    title: "نقل و انتقالات",
    context: [
      "گزارش زنده نقل و انتقالات محتمل و انجام‌شده تیم‌های دنیا",
      "آرشیو کامل نقل و انتقالات",
    ],
  },
  {
    title: "روزنامه‌های ورزشی",
    context: [
      "پوشش روزانه روزنامه‌های برتر کشور (خبر ورزشی، ایران ورزشی، شوت، گل و …)",
    ],
  },
  {
    title: "جدول رقابت‌ها و رده‌بندی",
    context: [
      "نمایش جدول رقابت‌های مختلف",
      "رده‌بندی لیگ‌های باشگاهی و ملی به‌صورت لحظه‌ای و به‌روز",
    ],
  },
  {
    title: "ویدئو و تصاویر",
    context: [
      "تماشای تصاویر و ویدئوهای ستاره‌های ورزشی و باشگاه‌های محبوب",
      "آرشیو ویدئویی ۲۴ ساعته تمامی رخدادها بر اساس دسته‌بندی",
    ],
  },
  {
    title: "ویدئو و تصاویر",
    context: [
      "تماشای تصاویر و ویدئوهای ستاره‌های ورزشی و باشگاه‌های محبوب",
      "آرشیو ویدئویی ۲۴ ساعته تمامی رخدادها بر اساس دسته‌بندی",
    ],
  },
];

export const metadata = {
  title: "درباره ما",
  description: "سایت ورزش یک سایت ورزشی برای اطلاع رسانی اخبار ورزشی جهان",
};

function page() {
  return (
    <section>
      <div className="bg-primary-600 flex items-center justify-center ">
        <div className="max-w-6xl flex md:flex-row flex-col">
          <div>
            <h4 className=" font-bold text-secondary-100">
              پوشش 24 ساعته و برخط خبرهای ورزشی
            </h4>
            <p className="text-sm space-y-2 font-extralight leading-11">
              ورزش ســه یک پایگاه خبـری ورزشـی می باشد که از سال 1389 فعالیت خود
              را آغاز نمود . رسالت اصلی ما ارسال سریع و دقیق و بی طرفانه اخبار
              ورزشـی به مخاطبان فارسـی زبان در سراسر دنیا می باشد. خبرنگاران ما
              در سراسر دنیا روزانه صدها خبر را در دسته بندی های ورزشی مختلف در
              وبسایت و شبکه های اجتماعی رسمی پایگاه بارگزاری می نماینـد. در حـال
              حاضـر ورزش سـه ، سـومین وبسـایـت پربازدید کشور طبـق آمار رسمی
              الکسا و پر بازدیدترین وبسایت خبری کشـور می باشـد . افتخـار مـا این
              اسـت که روزانه پذیرای میلیـون ها بازدید کننده از سراسر دنیا هستیم
              و این موضوع به ما امید و انرژی آن را میدهد که هر روز به دنبال حل
              چالش های جدید برای خدمت رسانی بهتر به کاربرهایمان باشیم .
            </p>
          </div>
          <Image
            src={"/assets/img/about/abute.png"}
            alt="iange"
            width={500}
            height={500}
          />
        </div>
      </div>
      <div className="grid grid-cols-1 md:grid-cols-3 gap-4 p-4  max-w-7xl mx-auto">
        {sections.map((section, index) => (
          <BoxAboute
            key={index}
            title={section.title}
            context={section.context}
          />
        ))}
      </div>
    </section>
  );
}

export default page;
