export const footerLinks = [
  {
    title: "سرویس ها",
    links: [
      "گزارش مردمی",
      "اخبار ورزشی",
      "پادکست",
      "لیگ ها و رقابت ها",
      "ویدیو",
    ],
  },
  {
    title: "راهنما",
    links: [
      "صفحه اصلی",
      "درباره ما",
      "ارتباط با ما",
      "فرصت های شغلی",
      "قوانین و مقررات",
    ],
  },
  {
    title: "سرویس ها",
    links: ["روزنامه", "نتایج زنده", "آنتن", "پیش بینی", "پخش زنده"],
  },
  {
    title: "سایر",
    links: [
      "جام ملت های آسیا",
      "بازی های آسیایی ۲۰۲۳",
      "رنکینگ فیفا",
      "نقل و انتقالات",
      "جدول لیگ برتر ایران",
    ],
  },
];
